{"weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"dtype": "float32", "shape": [32, 128], "name": "bidirectional_1/forward_lstm_8/kernel"}, {"dtype": "float32", "shape": [32, 128], "name": "bidirectional_1/forward_lstm_8/recurrent_kernel"}, {"dtype": "float32", "shape": [128], "name": "bidirectional_1/forward_lstm_8/bias"}, {"dtype": "float32", "shape": [32, 128], "name": "bidirectional_1/backward_lstm_8/kernel"}, {"dtype": "float32", "shape": [32, 128], "name": "bidirectional_1/backward_lstm_8/recurrent_kernel"}, {"dtype": "float32", "shape": [128], "name": "bidirectional_1/backward_lstm_8/bias"}, {"dtype": "float32", "shape": [64, 27278], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [27278], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [131262, 32], "name": "embedding_6/embeddings"}]}], "modelTopology": {"training_config": {"metrics": ["acc"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.0.4", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_6", "dtype": "int32", "output_dim": 32, "trainable": true, "embeddings_regularizer": null, "input_dim": 131262, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, null], "activity_regularizer": null, "input_length": null}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "unit_forget_bias": true, "dropout": 0.2, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_8", "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 27278, "use_bias": true, "activity_regularizer": null}}]}, "backend": "tensorflow"}, "generatedBy": "keras v2.0.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}